class Dog:
    pass


# 2. Создать два объекта класса Dog. Вывести их на экран
dog_1 = Dog()
dog_2 = Dog()
print(dog_1, dog_2)