# 1. Написать функцию, которая возвращает среднее арифметическое двух переданных ей аргументов (параметров).
def function_1(number_1, number_2):
    """
    Функция, возвращающая среднее арифметическое двух аргументов
    :param number_1: первый аргумент
    :param number_2: второй аргумент
    :return: среднее арифметическое аргументов
    """
    return (number_1 + number_2) / 2


print(function_1(45, 78))